## Pandas

pandas itu untuk mengeksplor data, memanipulasi data, analysis tool

Dataframe itu terdiri dari beberapa series

Dataframe = tabel
Series = kolom

In [2]:
import pandas as pd

In [3]:
pd.Series([1200, 2000, 3000, 4000])

0    1200
1    2000
2    3000
3    4000
dtype: int64

In [4]:
pd.Series(["Spaghetti", "Carbonara", "Aglio Olio"])

0     Spaghetti
1     Carbonara
2    Aglio Olio
dtype: object

In [5]:
pd.Series([12.5, 13.7, 20.685])

0    12.500
1    13.700
2    20.685
dtype: float64

dtype :
1. int64 : 64 menjelaskan bitnya
2. float64 : sama
3. kalo banyak tipe macem2, jadinya object
4. di Pandas, string juga object sebutannya

In [6]:
revenues = pd.Series([5555, 7000, 1980])

In [7]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [8]:
revenues.values

array([5555, 7000, 1980], dtype=int64)

In [9]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

#basic syntax = pd.series([values], index = [list indexnya] )

In [10]:
pd.Series([10,20,30,40,50], index = ["A", "B", "C", "D", "E"])

A    10
B    20
C    30
D    40
E    50
dtype: int64

perbedaan kurung bulat (), kurung kurawal {}, kurung siku []
1. [ ] tipe data list 
2. ( ) tipe data tuple/ pemanggilan fungsi
3. { } untuk dictionary

In [11]:
pd.Series({"Amsterdam":5, "Tokyo": 10, "Toronto": 25})

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

syntaxnya nggak boleh pakai =. harus :. kalo pakai = nanti error.

In [12]:
pd.Series({"Amsterdam"=5, "Tokyo"=10, "Toronto"= 25})

SyntaxError: invalid syntax (3934241150.py, line 1)

List vs Tuple vs Dictionary
1. List bisa diganti. Tuple nggak bisa diganti
2. Urutannya nggak berpengaruh banyak. Both list & tuple.
3. Pada dictionary, urutan bermasalah. Karena datanya pairs

In [19]:
city_revenues = pd.Series({"Amsterdam":5, "Tokyo": 10, "Toronto": 25})

In [13]:
city_employee_count = pd.Series({"Amsterdam": 1120, "Tokyo": 5000, "Okinawa": 9800 })

In [14]:
city_employee_count

Amsterdam    1120
Tokyo        5000
Okinawa      9800
dtype: int64

In [15]:
city_employee_count.index

Index(['Amsterdam', 'Tokyo', 'Okinawa'], dtype='object')

In [16]:
city_employee_count.values

array([1120, 5000, 9800], dtype=int64)

In [17]:
"Tokyo" in city_employee_count

True

In [18]:
"New York" in city_employee_count

False

## Membuat DataFrame

biasanya pakai dictionary. tapi bisa list dkk juga

##### data syntax
nama_dataframe = pd.DataFrame({
    'nama kolom 1': series1
    'nama kolom 2' : series2
})

In [20]:
city_revenues

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

In [21]:
city_employee_count

Amsterdam    1120
Tokyo        5000
Okinawa      9800
dtype: int64

In [22]:
city_data = pd.DataFrame({
   "revenues" : city_revenues,
   "employee_count": city_employee_count
})

In [23]:
city_data

           revenues  employee_count
Amsterdam       5.0          1120.0
Okinawa         NaN          9800.0
Tokyo          10.0          5000.0
Toronto        25.0             NaN

In [24]:
city_data.index

Index(['Amsterdam', 'Okinawa', 'Tokyo', 'Toronto'], dtype='object')

In [25]:
city_data.values

array([[5.00e+00, 1.12e+03],
       [     nan, 9.80e+03],
       [1.00e+01, 5.00e+03],
       [2.50e+01,      nan]])

1. dataframe bisa juga disebut 2 index axis
2. axis 1 = yang menurun (technically ini axis index ke 0)
3. axis 2 = yang mendatar (technically ini axis index ke 1)
4. axis berguna untuk delete

In [26]:
city_data.axes[0]

Index(['Amsterdam', 'Okinawa', 'Tokyo', 'Toronto'], dtype='object')

In [27]:
city_data.axes[1]

Index(['revenues', 'employee_count'], dtype='object')

In [28]:
city_data.columns

Index(['revenues', 'employee_count'], dtype='object')

In [29]:
city_data.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [30]:
city_data

           revenues  employee_count
Amsterdam       5.0          1120.0
Okinawa         NaN          9800.0
Tokyo          10.0          5000.0
Toronto        25.0             NaN

In [31]:
"Amsterdam" in city_data

False

false karena di city_data nggak ada kolom yang namanya amsterdam. di dataframe, ngeliatnya kolomnya.
kalo ini dicoba di series, bakal true. karena sereis lihat di index.

In [33]:
"Amsterdam" in city_revenues

True

In [34]:
"revenues" in city_data

True

In [35]:
city_revenues

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

In [36]:
city_revenues["Tokyo"]

10

In [37]:
city_revenues[1]

10

In [38]:
city_revenues[-1]

25

In [39]:
city_revenues[:1]

Amsterdam    5
dtype: int64

In [40]:
city_revenues[1:]

Tokyo      10
Toronto    25
dtype: int64

untuk akses bagian tertentu dari list:
var[start:stop:step]

In [47]:
city_revenues[1:2:2]

Tokyo    10
dtype: int64

In [48]:
city_revenues[:]

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

In [49]:
city_revenues["Amsterdam":]

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

## .loc & .iloc

biasanya dipakai untuk data yang indexingnya angka juga. jadi nggak bisa dipanggil pakai indexing yang diatas

In [57]:
colors = pd.Series(["red", "green", "blue", "pink", "yellow" ], index=[1,2,3,5,7])

In [58]:
colors

1       red
2     green
3      blue
5      pink
7    yellow
dtype: object

1. defaultnya disini mengikuti labelingnya. jadi kalau colors[1], akan keluar red. 
2. tapi ini menyebabkan ambiguitas. karena secara posisi, index nomor 1 adalah green (yang red itu 0)
3. sehingga dipakai loc dan iloc untuk memperjelas

In [59]:
colors[1]

'red'

In [60]:
colors[4]

KeyError: 4

In [61]:
colors[1:2]

2    green
dtype: object

1. .loc refer ke label index
2. .iloc refer ke (positional) index

In [62]:
colors.loc[1]

'red'

In [63]:
colors.iloc[1]

'green'

In [65]:
colors

1       red
2     green
3      blue
5      pink
7    yellow
dtype: object

1. kalau pakai .iloc, karena positional, jadinya yang akhir di exlcude (kalau [2:3], berarti ya 2:3-1. 2 doang)
2. kalau pakai .loc, karena label, semuanya masuk. gaada exclude. (kalau [2:3], ya label 2 ama 3 masuk semua)

In [64]:
colors.iloc[2:3]

3    blue
dtype: object

In [66]:
colors.loc[2:3]

2    green
3     blue
dtype: object

In [70]:
colors.iloc[-1]

'yellow'

In [69]:
colors.loc[:-1]

Series([], dtype: object)

In [71]:
city_revenues

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

In [74]:
city_revenues.loc["Amsterdam"]

5

In [75]:
city_revenues.iloc[1]

10

1. kalau di dataframe, bisa keluar nama kota dan revenue/employee_count nya
2. loc[row apa, kolom apa]

In [76]:
city_data

           revenues  employee_count
Amsterdam       5.0          1120.0
Okinawa         NaN          9800.0
Tokyo          10.0          5000.0
Toronto        25.0             NaN

In [78]:
city_data.employee_count

Amsterdam    1120.0
Okinawa      9800.0
Tokyo        5000.0
Toronto         NaN
Name: employee_count, dtype: float64

In [79]:
city_data.revenues

Amsterdam     5.0
Okinawa       NaN
Tokyo        10.0
Toronto      25.0
Name: revenues, dtype: float64

In [93]:
city_data.loc["Amsterdam", "revenues", "employee_count"]

IndexingError: Too many indexers

In [94]:
city_data.loc["Amsterdam", ["revenues", "employee_count"]]

revenues             5.0
employee_count    1120.0
Name: Amsterdam, dtype: float64

In [96]:
city_data.loc["Amsterdam":"Tokyo", ["revenues", "employee_count"]]

           revenues  employee_count
Amsterdam       5.0          1120.0
Okinawa         NaN          9800.0
Tokyo          10.0          5000.0

In [81]:
city_data.revenues[1:3]

Okinawa     NaN
Tokyo      10.0
Name: revenues, dtype: float64

In [82]:
city_data[1:3]

         revenues  employee_count
Okinawa       NaN          9800.0
Tokyo        10.0          5000.0

In [84]:
city_data["revenues"]

Amsterdam     5.0
Okinawa       NaN
Tokyo        10.0
Toronto      25.0
Name: revenues, dtype: float64

In [86]:
city_data["employee_count"]

Amsterdam    1120.0
Okinawa      9800.0
Tokyo        5000.0
Toronto         NaN
Name: employee_count, dtype: float64

1. ada kalanya .notation tidak bisa dipakai. bisa pakai yang [""]
2. ini terjadi saat nama pada dataframe sama dengan nama yang ada di Pandas & Python

In [88]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])

In [89]:
toys

           name   shape
0          ball  sphere
1  Rubik's cube    cube

In [91]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [92]:
toys.shape

(2, 2)

In [98]:
city_revenues

Amsterdam     5
Tokyo        10
Toronto      25
dtype: int64

In [100]:
city_revenues.sum()

40

In [101]:
city_revenues.mean()

13.333333333333334

In [102]:
city_revenues.max()

25

In [103]:
city_revenues.min()

5

In [104]:
city_data.revenues.min()

5.0

In [105]:
city_data.employee_count.mean()

5306.666666666667

## Combining Multiple Datasets

enriching a dataset

In [109]:
further_city_data = pd.DataFrame(
    {"revenues": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [110]:
further_city_data

           revenues  employee_count
New York       7000               2
Barcelona      3400               2

In [108]:
city_data

           revenues  employee_count
Amsterdam       5.0          1120.0
Okinawa         NaN          9800.0
Tokyo          10.0          5000.0
Toronto        25.0             NaN

In [117]:
all_city_data = pd.concat([city_data, further_city_data], sort=True)

In [118]:
all_city_data

           employee_count  revenues
Amsterdam          1120.0       5.0
Okinawa            9800.0       NaN
Tokyo              5000.0      10.0
Toronto               NaN      25.0
New York              2.0    7000.0
Barcelona             2.0    3400.0

In [115]:
all_city_data_sort = pd.concat([city_data, further_city_data], sort=False)

In [116]:
all_city_data_sort

           revenues  employee_count
Amsterdam       5.0          1120.0
Okinawa         NaN          9800.0
Tokyo          10.0          5000.0
Toronto        25.0             NaN
New York     7000.0             2.0
Barcelona    3400.0             2.0

parameter Sort  diatas gunanya adalah untuk mengurutkan

In [119]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [120]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [121]:
all_city_data

           employee_count  revenues
Amsterdam          1120.0       5.0
Okinawa            9800.0       NaN
Tokyo              5000.0      10.0
Toronto               NaN      25.0
New York              2.0    7000.0
Barcelona             2.0    3400.0

In [128]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)

In [129]:
cities

           employee_count  revenues  country  capital
Amsterdam          1120.0       5.0  Holland      1.0
Okinawa            9800.0       NaN      NaN      NaN
Tokyo              5000.0      10.0    Japan      1.0
Toronto               NaN      25.0   Canada      0.0
New York              2.0    7000.0      NaN      NaN
Barcelona             2.0    3400.0    Spain      0.0
Rotterdam             NaN       NaN  Holland      0.0

In [124]:
cities1 = pd.concat([all_city_data, city_countries], sort=False)

In [125]:
cities1

           employee_count  revenues  country  capital
Amsterdam          1120.0       5.0      NaN      NaN
Okinawa            9800.0       NaN      NaN      NaN
Tokyo              5000.0      10.0      NaN      NaN
Toronto               NaN      25.0      NaN      NaN
New York              2.0    7000.0      NaN      NaN
Barcelona             2.0    3400.0      NaN      NaN
Amsterdam             NaN       NaN  Holland      1.0
Tokyo                 NaN       NaN    Japan      1.0
Rotterdam             NaN       NaN  Holland      0.0
Toronto               NaN       NaN   Canada      0.0
Barcelona             NaN       NaN    Spain      0.0

In [130]:
pd.concat([all_city_data, city_countries], axis=1, join="inner")

           employee_count  revenues  country  capital
Amsterdam          1120.0       5.0  Holland        1
Tokyo              5000.0      10.0    Japan        1
Toronto               NaN      25.0   Canada        0
Barcelona             2.0    3400.0    Spain        0

In [131]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [132]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [133]:
cities

           employee_count  revenues  country  capital
Amsterdam          1120.0       5.0  Holland      1.0
Okinawa            9800.0       NaN      NaN      NaN
Tokyo              5000.0      10.0    Japan      1.0
Toronto               NaN      25.0   Canada      0.0
New York              2.0    7000.0      NaN      NaN
Barcelona             2.0    3400.0    Spain      0.0
Rotterdam             NaN       NaN  Holland      0.0

In [134]:
pd.merge(cities, countries, left_on="country", right_index=True)

,employee_count,revenues,country,capital,population_millions,continent
Amsterdam,1120.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,5000.0,10.0,Japan,1.0,127,Asia
Toronto,NaN,25.0,Canada,0.0,37,North America

by default, .merge ini pakai inner join. kalau mau pakai outer join (semuanya di merge), pakai kayak gini:

In [137]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)

,employee_count,revenues,country,capital,population_millions,continent
Amsterdam,1120.0,5.0,Holland,1.0,17.0,Europe
Okinawa,9800.0,NaN,NaN,NaN,NaN,NaN
Tokyo,5000.0,10.0,Japan,1.0,127.0,Asia
Toronto,NaN,25.0,Canada,0.0,37.0,North America
New York,2.0,7000.0,NaN,NaN,NaN,NaN
Barcelona,2.0,3400.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe

kalau pakai concat, jadinya gini

In [136]:
pd.concat([countries, cities], axis=1)

,population_millions,continent,employee_count,revenues,country,capital
Holland,17.0,Europe,NaN,NaN,NaN,NaN
Japan,127.0,Asia,NaN,NaN,NaN,NaN
Canada,37.0,North America,NaN,NaN,NaN,NaN
Amsterdam,NaN,NaN,1120.0,5.0,Holland,1.0
Okinawa,NaN,NaN,9800.0,NaN,NaN,NaN
Tokyo,NaN,NaN,5000.0,10.0,Japan,1.0
Toronto,NaN,NaN,NaN,25.0,Canada,0.0
New York,NaN,NaN,2.0,7000.0,NaN,NaN
Barcelona,NaN,NaN,2.0,3400.0,Spain,0.0
Rotterdam,NaN,NaN,NaN,NaN,Holland,0.0